#-*- coding: utf-8 -*-

from konlpy.tag import Mecab
import pandas as pd
import matplotlib.pyplot as plt
from wordcloud import WordCloud

pd.options.mode.chained_assignment = None  # default='warn'

mecab = Mecab()



bulyong_pumsa = ['NP', 'NR', 'NNB', 'MM', 'JKS', 'JKC', 'JKG',
                'JKO', 'JKB', 'JKV', 'JKQ', 'JC', 'JX', 'EP', 'EF',
                'EC', 'ETN', 'ETM', 'XPN', 'XSN', 'XSV', 'XSA',
                'SF', 'SE', 'SH', 'SC', 'SY', 'SSO', 'SSC', 'XSV+EF',
                'EC+EF', 'EC+EP', 'EC+JX', 'EC+JX+JX', 'EC+JX+VX+EP',
                'EC+JKO', 'EP+EC', 'JKS+EF', 'JC+JX', 'JKB+JX', 'JKB+JKO',
                'JKB+JX+JKS', 'JKB+VCP+EC', 'JKS+EP+EC', 'JX+JX', 'JX+VCP+ETM',
                'EP+EF', 'EC+JKS', 'EC+VCP', 'EC+VCP+EC', 'EP+EC+JX', 'EP+EC+VCP',
                'EP+EC+VX', 'EP+EF+VCP', 'EP+EP', 'EP+EP+EC', 'EP+EP+ETM', 'EP+EP+ETM'
                'EP+ETM+NNB+VCP', 'EP+ETM', 'EP+ETN', 'EP+ETN+JKB+JX', 'EP+ETN+VCP+EC',
                'EP+VCP+EC', 'ETM+NNB', 'ETM+NNB+JKS', 'ETM+NNB+JX', 'ETM+NNB+VCP+EF',
                'ETM+NNB+XSA+EC', 'ETM+NNB+XSA+EF', 'ETN+EF', 'ETN+JKB', 'ETN+VCP+EF',
                'NNB+EF', 'NNB+JKB', 'NNB+JKB+JX', 'NNB+JKC', 'NNB+JKO', 'NNB+JKO+JX',
                'NNB+JKS', 'NNB+JX', 'NNB+VCP', 'NNB+VCP+EC', 'NNB+VCP+EC+VCP', 'NNB+VCP+EF',
                'NNB+VCP+ETM', 'NNB+VCP+ETM+NNB+JX','MAJ', 'ETN+JX', 'SN', 'XSV+EC', 'IC', 'SL',
                'NNBC', 'NP+JX', 'NP+JKS', 'NP+JKO', 'EC+VV+EC' , 'MAG+JX', 'UNKNOWN']
bulyong_pyo = ['입니다', 'br', '이', '같', '해', '되', '하', '있', '들', '할', '정도', '보', '때',
               '일', '후', '했', '번', '나', '파', '지', '해요', '요', '합니다', '주', '넣', '함'
               '가', '넘', '될', '할', '볼', '된', '그런지', '봐야', '두', '예요', '였', '비해', '내',
               '됐', '잡', '인지', '면', '여', '라고', '한데', '슨', '햇', '이전', '라서', '해도', '임',
               '동안', '했어요', '그래도', '해야', '지', '네요', '오', '내요', '갔', '해도', '디', '첨',
               '트', '다니', '고', '스러워', '됨', '와', '잇', '제', '났', 'ㄱ', 'ㄴ', 'ㄷ', 'ㄹ', 'ㅁ',
               'ㅂ', 'ㅅ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ', '했었', '된다고', '따라', '졌', '그러',
               '봐요', '죠', '미', '줘서', '스러웠', '엘', '니', '해야', '단', '할게요', '스러운', '아', '라는',
               '기', '당', '여서', '뿌', '렴', '인가', '플', '어쩌', '져서', '송', '치', '지만', '터리', '쁩니다',
               '아닌데', '베', '조', '자분', '돼요', '씁니다', '걍', '그런가', '욜', '합니다', '한다고', '유',
               '참', '된다는', '니다', 'ㅣ', '해졌', '히', '졌어요', '납니다', '인데', '뭔가', '야', '여', '봐야',
               '나세', '브', '돼', '스럽', '됨', '젼', '족', '켈', '습', '니까', '쏙', '량', '든다고', '대',
               '됩니다', '이래서', '인듯', '겠어요', '드', '돼서', '죤', '괸', '스런', '해도', '못지않', '봐도',
               '겠', '됬', '난', '인해', '했으나', '로', '이슨', '했으나', '구요', '듬', '즈', '으셨어요',
               '레스', '뒤지', '고', '옴', '요번', '줘요', '구용', '집니다', '햇', '봐', '위니', '토', '된다',
               '렸', '업', '어떨지', '그래요', '구', '돼', '위한', '블', '스러워서', '시네', '여조','가','한다','가각',
               '가기','가량','가요','결국','계시','계신','곳','구여','귀','그날','그동안','그때','그랬','그랬나','그럴',
               '그렇','금','까','꺼라','껄','날','넹','다','다이','대한','대해','대해서','도','도중','두말','들이','땐','라',
               '라도','래','로움','릉','립니','며','뭔지','박','버','볼까','인데요','절','져','져요','해용','해져서','해진',
               '보여','보여서','보여요','보여져서','보여준다','보여집니다','보임','보이','봤','최','프','해봐야','해서',
               '보였','보인','보인다','보인다고','보인다며','보일','보일까','보입니다','봐야겠어요','통해',
               '봅니다','봐서','부','분도','비해서','샤','서','성','세','스','시','식','직','한다는','할까','할지',
               '쏘','싶','안시','에요','예','욤','워','이걸로','이러','이럴','인가요','인','했으니','했으면','헤',
               '가시','가심','가져다','감','갰','갯','거렸','거린다','거림','거립니다','겠다는','겠죠','겨','격',
               '계세요','계셔서','계셔야','계셔요','계셨','계신데','계십니다','구나','군요','긏','규','그간','그걸로',
               '그게','그땐','그래','그래서','그래서인지','그런','그런가요','그럼','그럼에도','근래','근대','걱','건','걸',
               '게','겔','겐','겟','겠구나','겠다','괴','구지','굼','궂','그리','극','껀','나서','榮','求','과',]
bulyong_ = {('서', 'VV+EC')}
bujeong_ = {('안', 'MAG'), ('못', 'MAG'), ('않', 'VX'),('아니', 'VCN')}

mapping_list={
    'CJmall':'CJ',
    'Cj':'CJ',
    'Full':'FULL',
    'Good':'굿',
    'good':'굿',
    'gooood':'굿',
    'goooood':'굿',
    'gooooood':'굿',
    'goooooood':'굿',
    'gooooooood':'굿',
    'great':'GREAT',
    '굳':'굿',
    'Excellent':'EXCELLENT',
    'Hdmi':'HDMI',
    'Iot':'IoT',
    'Korea':'KOREA',
    'LCDTV':'LCD',
    'Lg':'LG',
    '엘지':'LG',
    'Led':'LED',
    'Ok':'OK',
    'On':'ON',
    'RGBRGB':'RGB',
    'Tv':'TV',
    'UHDTV':'UHD',
    '티비':'TV',
    '티브이':'TV',
    '텔레비':'TV',
    '텔레비전':'TV',
    'tv':'TV',
    'delivered':'DELIVER',
    'gs':'GS',
    'hdr':'HDR',
    'ih':'IH',
    'led':'LED',
    '올레드':'OLED',
    'oled':'OLED',
    'Oled':'OLED',
    'Qled':'QLED',
    'qled':'QLED',
    'lg':'LG',
    'quickly':'QUICKLY',
    'uhd':'UHD',
    'usb':'USB',
    'hd':'HD',
    'fhd':'FHD',
    'AS':'A/S',
    'as':'A/S',
    'As':'A/S',
    'a/s':'A/S',

    '가격대':'가격',

    '가까운':'가까움',
    '가까울':'가까움',
    '가까워':'가까움',
    '가까워서':'가까움',
    '가까워요':'가까움',
    '가까웠':'가까움',
    '가까이':'가까움',
    '가깝':'가까움',

    '가까워져서':'가까워짐',

    '가느':'가느다람',
    '가늘':'가느다람',

    '가리':'가림',
    '가린':'가림',
    '가릴':'가림',
    '가림':'가림',
    '가립니다':'가림',
    '가려서':'가림',

    '가려져':'가려짐',
    '가려져서':'가려짐',
    '가려졌':'가려짐',
    '가려진':'가려짐',
    '가려질':'가려짐',

    '가리켜':'가르킴',
    '가리키':'가르킴',
    '가르켜':'가르킴',
    '가르키':'가르킴',

    '가르':'가르침',
    '가르쳐':'가르침',
    '가르쳐서':'가르침',

    '가벼우':'가벼움',
    '가벼운':'가벼움',
    '가벼운데':'가벼움',
    '가벼울':'가벼움',
    '가벼움':'가벼움',
    '가벼웁':'가벼움',
    '가벼워':'가벼움',
    '가벼워서':'가벼움',
    '가벼워져서':'가벼움',
    '가벼워졌':'가벼움',
    '가벼웠':'가벼움',
    '가볍':'가벼움',
    '가벼운가':'가벼움',
    '가벼운지':'가벼움',
    '가벼워진':'가벼움',

    '가성':'가성비',

    '가스렌지':'가스레인지',

    '가전':'가전제품',

    '가정용':'가정',
    '가정집':'가정',

    'ㄱㅅ':'감사',
    '감사':'감사',
    '감사용':'감사',
    '고마운':'감사',
    '고마울':'감사',
    '고마움':'감사',
    '고마워':'감사',
    '고마워서':'감사',
    '고마워요':'감사',
    '고마웠':'감사',
    '고마왔':'감사',
    '고맙':'감사',
    '갑사':'감사',

    '강':'강함',
    '강하':'강함',

    '가지':'가짐',

    '가져':'가져감',
    '가져가':'가져감',
    '가져간':'가져감',
    '가져간다':'가져감',
    '가져간다고':'가져감',
    '가져갈':'가져감',
    '가져갑니다':'가져감',
    '가져갔':'가져감',

    '가져다주':'가져다줌',

    '가져오':'가져옴',
    '가져온':'가져옴',
    '가져옴':'가져옴',
    '가져와':'가져옴',
    '가져와서':'가져옴',
    '가져왔':'가져옴',

    '가졌':'가짐',
    '가졌으니':'가짐',

    '가하':'가함',
    '가함':'가함',
    '가해':'가함',
    '가해서':'가함',

    '간다':'감',
    '간다고':'감',
    '간다는':'감',
    '간다면':'감',
    '간답니다':'감',

    '간식거리':'간식',

    '간지러운':'간지러움',
    '간지러워':'간지러움',
    '간지럽':'간지러움',

    '갈까':'갈까봐',

    '갈려':'갈음',
    '갈려고':'갈음',
    '갈려고요':'갈음',
    '갈려구':'갈음',

    '갈려서':'갈림',
    '갈리':'갈림',
    '갈린다':'갈림',
    '갈릴':'갈림',
    '갈립니다':'갈림',

    '갈아주':'갈아줌',
    '갈아치우':'갈아줌',
    '갈아줘야':'갈아줌',

    '갈지':'감',
    '갈진':'감',

    '감겨':'감김',
    '감겨서':'감김',
    '감김':'감김',

    '갈아타':'갈아탐',
    '갈아탄':'갈아탐',
    '갈아탈':'갈아탐',
    '갈아탔':'갈아탐',

    '갈아끼우':'갈아끼움',

    '감동이':'감동',

    '감싸':'감쌈',
    '감싼':'감쌈',

    '감싸여':'감싸임',

    '감탄사':'감탄',

    '갑니다':'감',

    '갑작스러웠':'갑작스러움',
    '갑작스런':'갑작스러움',
    '갑작스럽':'갑작스러움',

    '값비싼':'비쌈',

    '값싸':'쌈',
    '값싼':'쌈',

    '갔다오':'갔다옴',
    '갔다온':'갔다옴',
    '갔다왔':'갔다옴',

    '강성비':'가성비',

    '강한':'강함',
    '강한데':'강함',
    '강한지':'강함',
    '강할':'강함',
    '강함':'강함',
    '강합니다':'강함',
    '강해요':'강함',
    '강해서':'강함',
    '강해':'강함',
    '강했':'강함',

    '강해져서':'강해짐',
    '강해졌':'강해짐',
    '강해집니다':'강해짐',

    '갖':'가짐',

    '갖추':'갖춤',
    '갖춘':'갖춤',
    '갖출':'갖춤',
    '갖춤':'갖춤',
    '갖춰':'갖춤',
    '갖춰서':'갖춤',
    '갖춰야':'갖춤',
    '갖췄':'갖춤',
    '갖춰져':'갖춤',

    '같애':'같음',

    '갬성':'감성',

    '갬동':'감동',

    '거듭나':'거듭남',

    '거르':'거름',
    '거를':'거름',

    '거슬릴':'거슬림',
    '거슬려':'거슬림',
    '거슬려도':'거슬림',
    '거슬려서':'거슬림',
    '거슬렸':'거슬림',
    '거슬리':'거슬림',
    '거슬린':'거슬림',
    '거슬린다':'거슬림',
    '거슬린다는':'거슬림',
    '거슬림':'거슬림',
    '거슬립니다':'거슬림',

    '거치':'거침',
    '거쳐':'거침',
    '거쳤':'거침',
    '거쳐서':'거침',

    '거친':'거칠음',
    '거칠':'거칠음',

    '건드려':'건드림',
    '건드려도':'건드림',
    '건드렸':'건드림',
    '건드리':'건드림',
    '건드릴':'건드림',

    '건방지':'건방짐',
    '건방진':'건방짐',

    '건승':'건승하세요',

    '건조도':'건조',

    '건져':'건짐',
    '건졌':'건짐',

    '걷':'걷다',

    '걸러':'거름',
    '걸러낼':'거름',
    '걸러도':'거름',
    '걸러서':'거름',
    '걸러야':'거름',
    '걸렀':'거름',

    '걸러져':'걸러짐',
    '걸러져서':'걸러짐',
    '걸러진':'걸러짐',
    '걸러진다':'걸러짐',
    '걸러질':'걸러짐',

    '걸려도':'걸림',
    '걸려요':'걸림',
    '걸려와서':'걸림',
    '걸려왔':'걸림',
    '걸렸었':'걸림',
    '걸렸으나':'걸림',
    '걸렸으니':'걸림',
    '걸렸으며':'걸림',
    '걸리':'걸림',
    '걸립니다':'걸림',
    '걸린다는데':'걸림',
    '걸린다니':'걸림',
    '걸린단':'걸림',
    '걸려':'걸림',
    '걸려서':'걸림',
    '걸렸':'걸림',
    '걸린':'걸림',
    '걸린다':'걸림',
    '걸린다고':'걸림',
    '걸린다는':'걸림',
    '걸릴':'걸림',
    '걸림':'걸림',

    '걸맞':'걸맞음',

    '걸쳐':'걸침',
    '걸쳐서':'걸침',
    '걸치':'걸침',
    '걸칠':'걸침',

    '검수':'검수함',

    '검':'검은색',
    '검정':'검은색',

    '겁':'겁이남',
    '겁날':'겁이남',
    '겁났':'겁이남',

    '겉모양':'겉모습',

    '결재':'결제함',

    '게으르':'게으름',
    '게으른':'게으름',
    '게으름':'게으름',
    '게을러':'게으름',
    '게을러서':'게으름',

    '겜':'게임',

    '겨울철':'겨울',

    '겪':'겪음',

    '견고':'견고함',

    '견뎌왔':'견딤',
    '견디':'견딤',
    '견딘':'견딤',
    '견딜':'견딤',

    '결과물':'결과',

    '결로':'결로현상',

    '겸':'겸함',
    '겸하':'겸함',
    '겸할':'겸함',
    '겸해서':'겸함',

    '겹':'겹침',
    '겹겹':'겹침',
    '겹쳐':'겹침',
    '겹쳐서':'겹침',
    '겹치':'겹침',

    '경량급':'경량',

    '고가품':'고가',

    '고급품':'고급',

    '고르':'고름',
    '고른다고':'고름',
    '고를':'고름',
    '고른':'고름',

    '고모님':'고모',

    '고이':'고임',

    '고장나':'고장',
    '고장난':'고장',
    '고장났':'고장',

    '고쳐':'고침',
    '고쳐도':'고침',
    '고쳐서':'고침',
    '고쳤':'고침',
    '고치':'고침',
    '고친':'고침',
    '고칠':'고침',

    '골라':'고름',
    '골라골라':'고름',
    '골라서':'고름',
    '골랐':'고름',

    '골드':'골드색',

    '골칫덩이':'골칫거리',
    '골치':'골칫거리',

    '곰팡':'곰팡이',

    '곱':'고움',
    '곱디고운':'고움',

    '공청':'공기청정기',
    '공청기':'공기청정기',

    '구겨':'구겨짐',
    '구겨져':'구겨짐',
    '구겨져서':'구겨짐',
    '구겨지':'구겨짐',
    '구겨진':'구겨짐',
    '구겨짐':'구겨짐',
    '구김':'구겨짐',

    '구리':'구림',
    '구린':'구림',
    '구림':'구림',

    '구부':'구부림',
    '구부려':'구부림',
    '구부려서':'구부림',
    '구부려야':'구부림',
    '구부리':'구부림',
    '구부린':'구부림',
    '구부릴':'구부림',

    '구부러져':'구부러짐',
    '구부려지':'구부러짐',
    '구부러진':'구부러짐',
    '구부러질':'구부러짐',

    '구하':'구함',
    '구한':'구함',
    '구한다':'구함',
    '구한다고':'구함',
    '구한다는':'구함',
    '구할':'구함',
    '구함':'구함',
    '구합니다':'구함',
    '구해':'구함',
    '구해서':'구함',
    '구했':'구함',

    '굳혀':'굳힘',
    '굳혔':'굳힘',
    '굳히':'굳힘',
    '굳힌':'굳힘',

    '굴러':'굴러감',
    '굴러가':'굴러감',
    '굴러갈':'굴러감',
    '굴러갑니다':'굴러감',

    '굴러다니':'굴러다님',

    '굴렀':'굴림',
    '굴려':'굴림',
    '굴려도':'굴림',
    '굴려서':'굴림',
    '굴렸':'굴림',
    '굴리':'굴림',

    '굵':'굵음',

    '굽혀':'굽힘',
    '굽혀서':'굽힘',
    '굽혀야':'굽힘',
    '굽혔':'굽힘',
    '굽히':'굽힘',
    '굽힐':'굽힘',

    '궁금해하':'궁금',

    '권하':'권함',
    '권함':'권함',
    '권합니다':'권함',
    '권해':'권함',
    '권해서':'권함',
    '권했':'권함',

    '과장':'과장함',

    '과하':'과함',
    '과한':'과함',
    '과할':'과함',

    '객관':'객관적',

    '괘안':'괜찮음',
    '괘아나':'괜찮음',
    '갠찬':'괜찮음',
    '갠찮':'괜찮음',
    '갠춘':'괜찮음',
    '갠찮아요':'괜찮음',
    '괜잖네요':'괜찮음',
    '괜잖은거':'괜찮음',
    '괜짢아요':'괜찮음',
    '괜차나요':'괜찮음',
    '괜차나욤':'괜찮음',
    '괜차너요':'괜찮음',
    '괜찬':'괜찮음',
    '괜찬겟네요':'괜찮음',
    '괜찬고':'괜찮음',
    '괜찬네요':'괜찮음',
    '괜찬네욤':'괜찮음',
    '괜찬더라구요':'괜찮음',
    '괜찬습니다':'괜찮음',
    '괜찬습니드':'괜찮음',
    '괜찬아요':'괜찮음',
    '괜찬아지네요':'괜찮음',
    '괜찬어':'괜찮음',
    '괜찬은':'괜찮음',
    '괜찬은것':'괜찮음',
    '괜찬은데':'괜찮음',
    '괜찬을까':'괜찮음',
    '괜찬음':'괜찮음',
    '괜찬코':'괜찮음',
    '괜찮':'괜찮음',
    '괜찮고':'괜찮음',
    '괜찮아':'괜찮음',
    '괜챦아요':'괜찮음',
    '괜챦음':'괜찮음',
    '괜춘':'괜찮음',
    '괜춘네요':'괜찮음',
    '괜춘하네여':'괜찮음',
    '괜춘하네요':'괜찮음',
    '괜춘한거':'괜찮음',
    '괜춘한데':'괜찮음',
    '괜춘함':'괜찮음',
    '괜춘해요':'괜찮음',
    '괜츈한':'괜찮음',

    '급':'급함',

    '괴로웠':'괴로움',
    '괴롭혀':'괴로움',

    '구동':'구동함',

    '구려':'구림',

    '구부러지':'구부러짐',

    '구우':'구움',
    '구우면':'구움',
    '구운':'구움',
    '구울':'구움',
    '구워':'구움',
    '구워도':'구움',
    '구웠':'구움',
    '굽':'구움',

    '귀여':'귀여움',
    '귀여우':'귀여움',
    '귀여운데':'귀여움',
    '귀여운지':'귀여움',
    '귀여울':'귀여움',
    '귀여움':'귀여움',
    '귀여워도':'귀여움',
    '귀여워서':'귀여움',
    '귀여웠':'귀여움',
    '귀염':'귀여움',
    '귀엽':'귀여움',
    '귀요':'귀여움',
    '귀요미':'귀여움',
    '귀욤':'귀여움',
    '귀여워':'귀여움',
    '귀여운':'귀여움',

    '귀차':'귀찮음',
    '귀찬':'귀찮음',
    '귀찮':'귀찮음',

    '그려':'그림',
    '그려서':'그림',
    '그려요':'그림',

    '그려져':'그려짐',
    '그려져서':'그려짐',
    '그려진':'그려짐',

    '긁':'긁음',

    '긁혀':'긁힘',
    '긁혀서':'긁힘',
    '긁혀요':'긁힘',
    '긁혔':'긁힘',
    '긁히':'긁힘',
    '긁힌':'긁힘',
    '긁힐':'긁힘',

    '금욜':'금요일',

    '급속':'급속도',

    '급하':'급함',
    '급한':'급함',
    '급할':'급함',
    '급해':'급함',
    '급해서':'급함',
    '급했':'급함',

    '기다려도':'기다림',
    '기다려야':'기다림',
    '기다려본':'기다림',
    '기다려봅니다':'기다림',
    '기다려서':'기다림',
    '기다려야지':'기다림',
    '기다려요':'기다림',
    '기다렸':'기다림',
    '기다리':'기다림',
    '기다린':'기다림',
    '기다려':'기다림',
    '기다렸으나':'기다림',
    '기다린다':'기다림',
    '기다린다고':'기다림',
    '기다린다는':'기다림',
    '기다릴':'기다림',
    '기다림':'기다림',
    '기다립니다':'기다림',
    '기달':'기다림',
    '기달려':'기다림',
    '기달려야':'기다림',
    '기달렸':'기다림',
    '기달리':'기다림',

    '기다려져':'기다려짐',
    '기다려질':'기다려짐',
    '기다려짐':'기다려짐',

    '기대':'기대함',

    '기막히':'기막힘',
    '기막힌':'기막힘',
    '기막힘':'기막힘',

    '기뻐':'기쁨',
    '기뻐서':'기쁨',
    '기뻐요':'기쁨',
    '기뻤':'기쁨',
    '기쁘':'기쁨',
    '기쁜':'기쁨',
    '기쁨':'기쁨',
    '기쁩니다':'기쁨',

    '기뻐하':'기뻐함',
    '기뻐해서':'기뻐함',
    '기쁘했':'기뻐함',

    '기사님':'기사',

    '기울':'기움',
    '기울었':'기움',

    '기울어져':'기울어짐',
    '기울어지':'기울어짐',
    '기울어진':'기울어짐',
    '기울어진다':'기울어짐',

    '기울여':'기울임',
    '기울여서':'기울임',
    '기울였':'기울임',
    '기울이':'기울임',

    '긴':'긺',
    '길':'긺',
    '깁니다':'긺',

    '길들여':'길들임',
    '길들여야':'길들임',
    '길들이':'길들임',

    '길들여져':'길들여짐',
    '길들여진':'길들여짐',

    '깊':'깊음',

    '까다로와':'까다로움',
    '까다로운':'까다로움',
    '까다로운데':'까다로움',
    '까다로워':'까다로움',
    '까다로워서':'까다로움',
    '까다로웠':'까다로움',
    '까다로웠을':'까다로움',
    '까다롭':'까다로움',

    '까만':'검은색',
    '까만색':'검은색',
    '까망':'검은색',
    '까맣':'검은색',

    '까먹':'까먹음',

    '까져':'까짐',
    '까졌':'까짐',
    '까진':'까짐',

    '깐':'깔음',
    '깔':'깔음',
    '깜':'깔음',

    '깔려':'깔림',
    '깔려서':'깔림',
    '깔렸':'깔림',
    '깔리':'깔림',
    '깔린':'깔림',
    '깔린다':'깔림',
    '깔릴':'깔림',

    '깝놀':'놀람',
    '깝놀하고':'놀람',

    '깜박거리':'깜박임',
    '깜박거림':'깜박임',
    '깜박여':'깜박임',
    '깜박여야':'깜박임',
    '깜박이':'깜박임',
    '깜박인':'깜박임',
    '깜박임':'깜박임',
    '깜빡거리':'깜박임',
    '깜빡이':'깜박임',

    '깜빡하':'깜박함',
    '깜빡했':'깜박함',

    '깬':'깸',
    '깬다고':'깸',
    '깰까':'깸',
    '깸':'깸',
    '깹니다':'깸',
    '깼':'깸',

    '깨끗해':'깨끗함',
    '깨끗':'깨끗함',

    '깨닫':'깨달음',
    '깨달':'깨달음',

    '깨져':'깨짐',
    '깨져버려':'깨짐',
    '깨져서':'깨짐',
    '깨져요':'깨짐',
    '깨졌':'깨짐',
    '깨지':'깨짐',
    '깨진':'깨짐',
    '깨진다':'깨짐',

    '끄':'끄다',

    '꺼내':'꺼냄',
    '꺼낸':'꺼냄',
    '꺼낸다고':'꺼냄',
    '꺼낼':'꺼냄',
    '꺼냈':'꺼냄',

    '꺼려':'꺼림',
    '꺼려서':'꺼림',
    '꺼려졌':'꺼림',
    '꺼려했':'꺼림',
    '꺼렸':'꺼림',
    '꺼리':'꺼림',

    '꺼져':'꺼짐',
    '꺼져도':'꺼짐',
    '꺼져서':'꺼짐',
    '꺼졌':'꺼짐',
    '꺼지':'꺼짐',
    '꺼진':'꺼짐',
    '꺼진다':'꺼짐',
    '꺼질':'꺼짐',
    '꺼짐':'꺼짐',
    '꺼집니다':'꺼짐',

    '꺽':'꺾음',
    '꺾':'꺾음',

    '꺽여':'꺾임',
    '꺽이':'꺾임',
    '꺾여':'꺾임',
    '꺾여서':'꺾임',
    '꺾이':'꺾임',
    '꺾인':'꺾임',
    '꺾임':'꺾임',

    '꼽':'꽂음',
    '꽂':'꽂음',

    '끝나':'끝남',
    '끝내':'끝남',

    '끼여':'낌',
    '끼여서':'낌',
    '끼였':'낌',
    '낀':'낌',
    '낀다':'낌',
    '낀다고':'낌',
    '낀다는':'낌',
    '낄':'낌',
    '낌':'낌',
    '낍니다':'낌',
    '껴':'낌',
    '껴도':'낌',
    '껴서':'낌',
    '껴야':'낌',
    '껴요':'낌',
    '꼈':'낌',

    '끼워':'끼움',
    '끼우':'끼움',
    '끼운':'끼움',
    '끼울':'끼움',
    '끼움':'끼움',
    '끼워도':'끼움',
    '끼워둔':'끼움',
    '끼워둘':'끼움',
    '끼워서':'끼움',
    '끼워야':'끼움',
    '끼웠':'끼움',

    '끼워져':'끼워짐',
    '끼워져서':'끼워짐',

    '끼워준':'끼워줌',

    '끼쳤':'끼침',
    '끼치':'끼침',
    '끼칠':'끼침',
    '끼칩니다':'끼침',

    '꼬여':'꼬임',
    '꼬여서':'꼬임',
    '꼬이':'꼬임',
    '꼬인':'꼬임',
    '꼬일':'꼬임',
    '꼬임':'꼬임',

    '꼽혀':'꼽힘',
    '꼽히':'꼽힘',
    '꼽힌':'꼽힘',
    '꼽힐':'꼽힘',

    '꽂혀':'꽂힘',
    '꽂혀서':'꽂힘',
    '꽂혔':'꽂힘',

    '꾸몄':'꾸밈',
    '꾸미':'꾸밈',

    '끄':'끄다',
    '끄니':'끄다',

    '끊':'끊음',

    '끊겨':'끊김',
    '끊겨서':'끊김',
    '끊겼':'끊김',
    '끊기':'끊김',
    '끊긴다는':'끊김',
    '끊김':'끊김',
    '끊어져도':'끊김',
    '끊어져서':'끊김',
    '끊어진':'끊김',
    '끊어질':'끊김',

    '끌':'끌음',

    '끌려':'끌림',
    '끌려서':'끌림',
    '끌렸':'끌림',
    '끌리':'끌림',
    '끌림':'끌림',

    '끌려오':'끌려옴',

    '끓':'끓음',

    '끓여':'끓임',
    '끓여도':'끓임',
    '끓여서':'끓임',
    '끓여야':'끓임',
    '끓였':'끓임',
    '끓이':'끓임',
    '끓인':'끓임',
    '끓일':'끓임',

    '끝난':'끝남',
    '끝난다':'끝남',
    '끝날':'끝남',
    '끝남':'끝남',
    '끝납니다':'끝남',
    '끝났':'끝남',

    '끝낸':'끝냄',
    '끝낼':'끝냄',
    '끝냈':'끝냄',
    '끝냈으니':'끝냄',

    '끝장':'끝장남',
    '끝장나':'끝장남',

    '나가':'나감',
    '나간':'나감',
    '나간다':'나감',
    '나간다고':'나감',
    '나간다는':'나감',
    '나갈':'나감',
    '나감':'나감',
    '나갑니다':'나감',
    '나갔':'나감',

    '나누':'나눔',
    '나눌':'나눔',
    '나눔':'나눔',
    '나눠':'나눔',
    '나눠서':'나눔',

    '나눠져':'나뉨',
    '나눠진다':'나뉨',
    '나뉘':'나뉨',
    '나뉜':'나뉨',
    '나뉜다':'나뉨',
    '나뉨':'나뉨',

    '나머진':'나머지',

    '나무라':'나무람',
    '나무랄':'나무람',

    '나빠':'나쁨',
    '나빠서':'나쁨',
    '나빠요':'나쁨',
    '나빴':'나쁨',
    '나쁜':'나쁨',
    '나쁘':'나쁨',
    '나쁜데':'나쁨',
    '나쁜데요':'나쁨',
    '나쁜지':'나쁨',
    '나쁠':'나쁨',
    '나쁨':'나쁨',
    '나쁩니다':'나쁨',

    '나빠져':'나빠짐',
    '나빠져서':'나빠짐',
    '나빠졌':'나빠짐',
    '나빠진':'나빠짐',
    '나빠질':'나빠짐',

    '나아요':'나음',
    '나았':'나음',

    '나아졌':'나아짐',
    '나아지':'나아짐',
    '나아진':'나아짐',
    '나아진다':'나아짐',
    '나아질':'나아짐',

    '나오':'나옴',
    '나온':'나옴',
    '나온다':'나옴',
    '나온다고':'나옴',
    '나온다는':'나옴',
    '나온다며':'나옴',
    '나온다면':'나옴',
    '나온답니다':'나옴',
    '나온대요':'나옴',
    '나온지':'나옴',
    '나올':'나옴',
    '나옴':'나옴',
    '나옵니다':'나옴',
    '나와':'나옴',
    '나와서':'나옴',
    '나왓':'나옴',
    '나왔':'나옴',
    '나왔었':'나옴',
    '나와요':'나옴',

    '나타':'나타남',
    '나타나':'나타남',
    '나타날':'나타남',
    '나타남':'나타남',
    '나타납니다':'나타남',
    '나타났':'나타남',

    '나타내':'나타냄',

    '낚':'낚음',

    '낚였':'낚임',
    '낚이':'낚임',

    '난다':'남',
    '난다거나':'남',
    '난다고':'남',
    '난다구요':'남',
    '난다는':'남',
    '난다면':'남',
    '났었':'남',

    '난리':'난리남',
    '난리나':'난리남',
    '난립니다':'난리남',

    '날라가':'날아감',
    '날라간':'날아감',
    '날라갈':'날아감',
    '날라갔':'날아감',
    '날라갔었':'날아감',
    '날아가':'날아감',
    '날아갈':'날아감',
    '날아갔':'날아감',

    '날려':'날림',
    '날려서':'날림',
    '날렸':'날림',
    '날리':'날림',
    '날린':'날림',
    '날린다':'날림',
    '날릴':'날림',
    '날림':'날림',

    '날아다니':'날아다님',
    '날아다녀요':'날아다님',
    '날아다녔':'날아다님',
    '날아다니':'날아다님',

    '날라오':'날아옴',
    '날라와':'날아옴',
    '날아오':'날아옴',
    '날아왔':'날아옴',

    '날자':'날짜',

    '날카로운':'날카로움',
    '날카로워':'날카로움',
    '날카롭':'날카로움',

    '낡':'낡음',

    '남기':'남김',
    '남겨':'남김',
    '남겨도':'남김',
    '남겨뒀':'남김',
    '남겨서':'남김',
    '남겨야':'남김',
    '남겨요':'남김',
    '남겨진':'남김',
    '남겼':'남김',
    '남겼었':'남김',
    '남겼으나':'남김',
    '남긴':'남김',
    '남긴다':'남김',
    '남길':'남김',
    '남김':'남김',

    '남다르':'남다름',
    '남다른':'남다름',
    '남달라':'남다름',
    '남달라서':'남다름',

    '남아나':'남음',
    '남아도':'남음',
    '남아돌':'남음',

    '낫':'나음',

    '낭낭':'넉넉함',
    '넉넉':'넉넉함',

    '낮추':'낮춤',
    '낮춘':'낮춤',
    '낮출':'낮춤',
    '낮춰':'낮춤',
    '낮춰서':'낮춤',
    '낮췄':'낮춤',

    '낳':'낳음',

    '내놓':'내놓음',
    '내놔':'내놓음',
    '내놔도':'내놓음',
    '내놔라':'내놓음',
    '내놨':'내놓음',

    '내려':'내려가다',
    '내려가':'내려가다',
    '내려간':'내려가다',
    '내려간다':'내려가다',
    '내려간다고':'내려가다',
    '내려갈':'내려가다',
    '내려감':'내려가다',
    '내려갑니다':'내려가다',
    '내려갔':'내려가다',

    '내려놓':'놓음',
    '내려놔야':'놓음',

    '내려':'내림',
    '내려서':'내림',
    '내려야':'내림',
    '내렸':'내림',
    '내리':'내림',
    '내린':'내림',
    '내릴':'내림',
    '내림':'내림',

    '내려오':'내려옴',
    '내려오':'내려옴',
    '내려와':'내려옴',
    '내려와서':'내려옴',
    '내려와요':'내려옴',
    '내려왔':'내려옴',

    '내용물':'내용',

    '낼':'내일',

    '냄새나':'냄새남',

    '냉':'냉기',

    '냉동고':'냉동실',

    '냉장실':'냉장고',

    '넷플':'넷플릭스',

    '널널':'넉넉함',

    '널어놓':'널어놓음',

    '넓직':'넓음',

    '넘겨':'넘김',
    '넘기':'넘김',
    '넘길':'넘김',

    '넘어가':'넘어감',
    '넘어갈':'넘어감',

    '넘어오':'넘어옴',
    '넘어왔':'넘어옴',

    '넘어지':'넘어짐',

    '넘치':'넘침',
    '넘친':'넘침',

    '놀라':'놀람',
    '놀랐':'놀람',
    '놀랬':'놀람',

    '놓':'놓음',
    '놨':'놓음',
    '놔':'놓음',
    '놔도':'놓음',
    '놨는데':'놓음',

    '놀라울':'놀라움',
    '놀라워':'놀라움',
    '놀라웠':'놀라움',

    '놀랄':'놀람',
    '놀랍':'놀람',
    '놀래':'놀람',

    '높':'높음',

    '높여':'높임',

    '놓아주':'놓아줌',

    '놓여':'놓임',

    '놓치':'놓침',

    '놔두':'놓음',
    '놔뒀':'놓음',
    '놔서':'놓음',
    '놔야':'놓음',
    '놨더니':'놓음',
    '놨어요':'놓음',

    '누락':'누락됨',

    '누래지':'누래짐',

    '누런':'누렇',

    '누룽이':'누룽지',

    '누르':'누름',
    '눌러':'누름',
    '눌':'누름',
    '누른':'누름',
    '누를':'누름',

    '누룬밥':'눌은밥',
    '누른밥':'눌은밥',

    '누워':'누움',
    '누워서':'누움',

    '눈여겨':'눈여겨봄',

    '눌러붙':'눌러붙음',

    '눌러서':'누름',
    '눌러야':'누름',
    '눌렀':'누름',

    '눌려':'눌림',
    '눌리':'눌림',

    '눕혀':'눕힘',

    '느껴':'느낌',
    '느껴서':'느낌',
    '느껴요':'느낌',
    '느껴져서':'느낌',
    '느껴져요':'느낌',
    '느껴졌':'느낌',
    '느껴질':'느낌',
    '느껴짐':'느낌',
    '느꼈':'느낌',
    '느끼':'느낌',
    '느낀':'느낌',
    '느낄':'느낌',
    '느낍니다':'느낌',
    '느껴집니다':'느낌',

    '느림':'느림',
    '느':'느림',
    '느려':'느림',
    '느려도':'느림',
    '느려서':'느림',
    '느려요':'느림',
    '느렸':'느림',
    '느리':'느림',
    '느린':'느림',
    '느린데':'느림',
    '느릴':'느림',

    '늘어나':'늘어남',

    '늦':'늦음',

    '다가오':'다가옴',

    '다녀':'다님',
    '다녀서':'다님',
    '다녀야':'다님',
    '다녀요':'다님',
    '다녔':'다님',
    '다닐':'다님',
    '다닙니다':'다님',

    '다녀오':'다녀옴',

    '다른':'다름',
    '다르':'다름',
    '다를':'다름',
    '다릅니다':'다름',

    '다루':'다룸',

    '다치':'다침',

    '닦':'닦음',

    '달라':'다름',
    '달라서':'다름',
    '달라요':'다름',
    '달랐':'다름',

    '달라붙':'달라붙음',

    '달라져서':'달라짐',
    '달라졌':'달라짐',
    '달라지':'달라짐',
    '달라진':'달라짐',
    '달라집니다':'달라짐',

    '달려':'달림',
    '달려서':'달림',
    '달린':'달림',

    '닳':'닳음',

    '담':'다음',

    '담겨':'담김',

    '담날':'다음날',

    '답':'답변',

    '당기':'당김',
    '당길':'당김',

    '당한':'당함',
    '당했':'당함',

    '닿':'닿음',

    '댕댕이':'강아지',

    '더러운':'더러움',
    '더러워':'더러움',
    '더럽':'더러움',

    '덕':'덕분',

    '덜하':'덜함',
    '덜한':'덜함',

    '덮':'덮음',

    '도와':'도움',

    '도망가':'도망감',

    '돌려놓':'돌려놓음',

    '돌려받':'돌려받음',

    '돌':'돌림',
    '돌려':'돌림',
    '돌려도':'돌림',
    '돌려서':'돌림',
    '돌려야':'돌림',
    '돌려요':'돌림',
    '돌렸':'돌림',
    '돌리':'돌림',
    '돌린':'돌림',
    '돌립니다':'돌림',

    '돌려주':'돌려줌',

    '돌아':'돎',

    '돌아가':'돌아감',
    '돌아갈':'돌아감',
    '돌아갔':'돌아감',
    '돌아갑니다':'돌아감',

    '돌아다녀':'돌아다님',
    '돌아다니':'돌아다님',

    '돌아오':'돌아옴',
    '돌아왔':'돌아옴',

    '동그란':'동그랗다',

    '두꺼운':'두꺼움',
    '두꺼워':'두꺼움',
    '두꺼워서':'두꺼움',
    '두껍':'두꺼움',
    '두툼':'두꺼움',

    '둔':'둔함',
    '둔감':'둔함',
    '둔한':'둔함',

    '둘러보':'둘러봄',

    '둘려고':'둠',

    '둥근':'둥글',

    '뒤늦':'뒤늦음',

    '뒤져':'뒤짐',
    '뒤져서':'뒤짐',

    '뒤집':'뒤집음',

    '뒤쳐지':'뒤쳐짐',

    '뒷면':'뒤',

    '드려요':'줌',
    '드렸':'줌',
    '드리':'줌',
    '드린':'줌',
    '드립니다':'줌',

    '들리':'들림',
    '들려요':'들림',
    '들려':'들림',
    '들려서':'들림',
    '들렸':'들림',
    '들릴':'들림',

    '들러붙':'들어붙음',

    '들어가':'들어감',
    '들어간':'들어감',
    '들어간다고':'들어감',
    '들어갈':'들어감',
    '들어갑니다':'들어감',
    '들어갔':'들어감',

    '들어오':'들어옴',
    '들어온':'들어옴',
    '들어옵니다':'들어옴',
    '들어와':'들어옴',
    '들어와서':'들어옴',
    '들어와요':'들어옴',
    '들어왔':'들어옴',

    '들여':'들임',
    '들여놓':'들임',
    '들여서':'들임',
    '들였':'들임',

    '디지니':'디즈니',

    '디지탈':'디지털',

    '딤체':'딤채',

    '따라가':'따라감',

    '따라오':'따라옴',
    '따라올':'따라옴',

    '따져':'따짐',
    '따져서':'따짐',
    '따지':'따짐',

    '딸내미':'딸',
    '딸래미':'딸',
    '딸아이':'딸',

    '딸려':'딸림',
    '딸리':'딸림',

    '때리':'때림',

    '떨리':'떨림',

    '떨어뜨리':'떨어뜨림',

    '떨어져':'떨어짐',
    '떨어져서':'떨어짐',
    '떨어져요':'떨어짐',
    '떨어졌':'떨어짐',
    '떨어지':'떨어짐',
    '떨어진':'떨어짐',
    '떨어진다는':'떨어짐',
    '떨어질':'떨어짐',
    '떨어질까':'떨어짐',
    '떨어집니다':'떨어짐',

    '똑같':'똑같음',

    '똑똑이':'똑똑',

    '뛰어나':'뛰어남',
    '뛰어난':'뛰어남',
    '뛰어납니다':'뛰어남',

    '뛰어넘':'뛰어넘음',

    '뜨거운':'뜨거움',
    '뜨겁':'뜨거움',

    '뜯':'뜯음',
    '뜯어보':'뜯음',

    '뜯겨':'뜯김',

    '뜸들이':'뜸들임',

    '리모콘':'리모컨',

    '마니파':'많이파세요',

    '마르':'마름',

    '마쳤':'마침',

    '막혀':'막힘',
    '막혀서':'막힘',
    '막히':'막힘',

    '만나':'만남',
    '만난':'만남',
    '만났':'만남',

    '만든':'만듦',

    '말라서':'말림',
    '말리':'말림',

    '마음먹':'마음',

    '만드':'만듦',
    '만들':'만듦',

    '만족감':'만족',
    '만족도':'만족',

    '많':'많음',
    '마니':'많음',
    '많이':'많음',

    '말라':'마름',
    '말라요':'마름',
    '말랐':'마름',

    '말려':'말림',
    '말려서':'말림',
    '말려야':'말림',
    '말렸':'말림',
    '말릴':'말림',

    '맘놓':'마음놓임',

    '맘먹':'마음먹음',

    '맛보':'맛봄',

    '맛없':'맛없음',

    '맛있':'맛있음',
    '맛나':'맛있음',
    '맛난':'맛있음',

    '망가져':'망가짐',
    '망가져서':'망가짐',
    '망가지':'망가짐',
    '망가진':'망가짐',

    '망설':'망설임',
    '망설이':'망설임',
    '망설였':'망설임',

    '망했':'망함',

    '맞추':'맞춤',
    '맞춘':'맞춤',
    '맞출':'맞춤',
    '맞춤':'맞춤',
    '마춰':'맞춤',
    '맞춰':'맞춤',
    '맞춰서':'맞춤',
    '맞춰야':'맞춤',
    '맞춰왔':'맞춤',
    '맞췄':'맞춤',
    '맞쳐서':'맞춤',

    '맡겨':'맡김',
    '맡기':'맡김',

    '매끄럽':'매끄러움',
    '매끈':'매끄러움',

    '멈추':'멈춤',
    '멈춰':'멈춰',
    '멈춰서':'멈춤',

    '멋':'멋짐',
    '멋있':'멋짐',
    '멋지':'멋짐',
    '멋져요':'멋짐',
    '멋진':'멋짐',

    '모르':'모름',
    '모른다고':'모름',
    '모를':'모름',
    '모릅니다':'모름',
    '몰라':'모름',
    '몰라도':'모름',
    '몰라서':'모름',
    '몰라요':'모름',
    '몰랐':'모름',

    '목욜':'목요일',

    '못사':'못삼',

    '못하':'못함',
    '못한':'못함',
    '못할':'못함',
    '못합니다':'못함',
    '못해':'못함',
    '못해서':'못함',
    '못했':'못함',

    '무거':'무거움',
    '무거우':'무거움',
    '무거운':'무거움',
    '무거운데':'무거움',
    '무거울':'무거움',
    '무거워':'무거움',
    '무거워서':'무거움',
    '무거웠':'무거움',
    '무겁':'무거움',

    '문제없':'문제없음',

    '미끄러지':'미끄러짐',

    '미루':'미룸',
    '미뤄':'미룸',
    '미뤄서':'미룸',
    '미뤘':'미룸',

    '미쳤':'미침',
    '미치':'미침',
    '미친':'미침',

    '믿':'믿음',

    '밀려':'밀림',
    '밀려서':'밀림',
    '밀렸':'밀림',
    '밀린':'밀림',

    '바꾸':'바꿈',
    '바꾼':'바꿈',
    '바꿀':'바꿈',
    '바꿔':'바꿈',
    '바꿔서':'바꿈',
    '바꿨':'바꿈',

    '바뀌':'바뀜',
    '바뀐':'바뀜',
    '바꼈':'바뀜',

    '바라':'바라다',
    '바랍니다':'바라다',
    '바래':'바라다',
    '바래요':'바라다',
    '바램':'바라다',

    '바르':'바름',

    '바빠':'바쁨',
    '바빠서':'바쁨',
    '바쁘':'바쁨',
    '바쁜':'바쁨',

    '박살':'박살남',

    '반하':'반함',
    '반해':'반함',
    '반해서':'반함',
    '반했':'반함',

    '받':'받음',
    '받아쓰':'받음',
    '받으':'받음',
    '받자':'받음',

    '받쳐':'받침',

    '밝':'밝기',

    '밝아졌':'밝아짐',

    '밥공기':'밥그릇',

    '밥풀':'밥알',

    '밥통':'밥솥',

    '밧데리':'배터리',

    '버려':'버림',
    '버려야':'버림',
    '버리':'버림',
    '버린':'버림',
    '버립니다':'버림',
    '버려서':'버림',
    '버렸':'버림',
    '버릴':'버림',

    '버벅거리':'버벅거림',

    '버텨':'버팀',

    '번거':'번거로움',
    '번거로운':'번거로움',
    '번거로워':'번거로움',
    '번거로워서':'번거로움',
    '번거로웠':'번거로움',
    '번거롭':'번거로움',

    '번창':'번창하세요',

    '벗겨':'벗김',
    '벗기':'벗김',

    '벗겨져':'벗겨짐',
    '벗겨져서':'벗겨짐',
    '벗겨지':'벗겨짐',

    '벗어나':'벗어남',

    '벽면':'벽',

    '변하':'변함',
    '변해서':'변함',
    '변해요':'변함',
    '변했':'변함',

    '별거':'별거아님',

    '별루':'별로',

    '보':'보다',
    '보고':'보다',

    '보내':'보냄',
    '보냈':'보냄',

    '보임':'보임',
    '보여':'보임',
    '보여서':'보임',
    '보여요':'보임',
    '보여져서':'보임',
    '보여준다':'보임',
    '보여집니다':'보임',
    '보였':'보임',
    '보이':'보임',
    '보인':'보임',
    '보인다':'보임',
    '보인다고':'보임',
    '보인다며':'보임',
    '보일':'보임',
    '보일까':'보임',
    '보입니다':'보임',

    '봅니다':'보다',
    '봐서':'보다',
    '봐야겠어요':'보다',

    '본품':'본체',

    '부드러운':'부드러움',
    '부드럽':'부드러움',
    '부드러워':'부드러움',
    '부드러워서':'부드러움',
    '부드러웠':'부드러움',

    '부딪치':'부딪힘',
    '부딪히':'부딪힘',

    '부러워':'부러움',
    '부럽':'부러움',

    '부러져서':'부러짐',
    '부러지':'부러짐',
    '부러질':'부러짐',

    '부서지':'부서짐',

    '부자연':'부자연스러움',

    '부족':'부족함',

    '부지런':'부지런함',

    '불만족스럽':'불만족',

    '불안감':'불안',

    '붙':'붙음',

    '붙여':'붙임',

    '브렌드':'브랜드',

    '비슷':'비슷함',
    '비슷비슷':'비슷함',
    '비스무리':'비슷함',

    '비싼':'비쌈',
    '비싼게':'비쌈',
    '비싼데':'비쌈',
    '비쌉니다':'비쌈',
    '비쌌':'비쌈',
    '비싸':'비쌈',

    '비우':'비움',
    '비워':'비움',
    '비워야':'비움',
    '비웠':'비움',

    '비좁':'비좁음',

    '비춰':'비춤',

    '빠르':'빠름',
    '빠른':'빠름',
    '빠른데':'빠름',
    '빠른지':'빠름',
    '빠를':'빠름',
    '빠름':'빠름',
    '빠릅니다':'빠름',
    '빨랐':'빠름',
    '빨라':'빠름',
    '빨라서':'빠름',
    '빨라요':'빠름',
    '빨랐으나':'빠름',
    '빨랐으면':'빠름',
    '빨리':'빠름',

    '빠지':'빠짐',
    '빠질':'빠짐',
    '빠집니다':'빠짐',
    '빠져서':'빠짐',
    '빠져요':'빠짐',
    '빠졌':'빠짐',
    '빠져':'빠짐',
    '빠진':'빠짐',

    '빨간불로':'빨간불',
    '빨간불이':'빨간불',

    '빨강':'빨간색',
    '빨갛':'빨간색',

    '빠':'빨음',
    '빨':'빨음',

    '빨려':'빨림',
    '빨린':'빨림',

    '빨아당기':'빨아당김',

    '빨아들여':'빨아들임',
    '빨아들였':'빨아들임',
    '빨아들이':'빨아들임',
    '빨아들인':'빨아들임',
    '빨아들일':'빨아들임',

    '빵빵':'빵빵함',

    '빼':'뺌',
    '빼내':'뺌',
    '빼놓':'뺌',
    '뺄':'뺌',
    '뺏':'뺌',
    '뺐':'뺌',

    '뻣뻣':'뻣뻣함',

    '뽀대':'뽀대남',

    '뿌려':'뿌림',
    '뿌리':'뿌림',

    '뿌연':'뿌옇',

    '사':'사다',
    '삿':'사다',
    '샀':'사다',
    '샀어요':'사다',
    '샀었':'사다',
    '샀으면':'사다',
    '사도':'사다',
    '사려':'사다',
    '사면':'사다',
    '사세요':'사다',
    '살걸':'사다',
    '살까':'사다',
    '삽니다':'사다',

    '사라졌':'사라짐',
    '사라지':'사라짐',
    '사라진':'사라짐',

    '살아나':'살아남',

    '싸이즈':'사이즈',

    '새':'새로움',

    '색':'색상',
    '색감':'색상',
    '색깔':'색상',
    '색도':'색상',
    '색이':'색상',

    '생각나':'생각남',
    '생각납니다':'생각남',
    '생각날':'생각남',

    '생겨서':'생김',
    '생겼':'생김',
    '생긴':'생김',

    '선명도':'선명',

    '설명도':'설명',

    '설지':'설치',

    '설치기사님':'설치기사',

    '세련':'세련됨',
    '세련되':'세련됨',

    '소리나':'소리남',

    '소린':'소리',
    '소린지':'소리',

    '속상하':'속상',
    '속상해요':'속상',
    '속상했':'속상',

    '속터지':'속터짐',

    '손색없':'손색없음',

    '수욜':'수요일',

    '수월':'수월함',

    '손쉽':'쉬움',
    '쉬':'쉬움',
    '쉬운':'쉬움',
    '쉬울':'쉬움',
    '쉬워':'쉬움',
    '쉬워요':'쉬움',
    '쉬워서':'쉬움',
    '쉬워졌':'쉬움',
    '쉬웠':'쉬움',
    '쉽':'쉬움',

    '습하':'습함',
    '습한':'습함',
    '습했':'습함',

    '시끄러':'시끄러움',
    '시끄러운':'시끄러움',
    '시끄러운데':'시끄러움',
    '시끄러울':'시끄러움',
    '시끄러워':'시끄러움',
    '시끄러워서':'시끄러움',
    '시끄러웠':'시끄러움',
    '시끄럽':'시끄러움',

    '시어머님':'시어머니',

    '시원찮':'시원찮음',

    '시켜':'시킴',
    '시켰':'시킴',

    '신상':'신상품',

    '싫':'싫음',

    '심하':'심함',
    '심한':'심함',
    '심할':'심함',
    '심합니다':'심함',
    '심해':'심함',
    '심해서':'심함',
    '심해요':'심함',
    '심했':'심함',

    '심해져서':'심해짐',

    '싸':'쌈',
    '싸서':'쌈',
    '싼':'쌈',
    '쌉니다':'쌈',

    '써비스':'서비스',

    '썬':'썰음',
    '썰':'썰음',

    '써도':'씀',
    '써서':'씀',
    '써야':'씀',
    '써요':'씀',
    '썼':'씀',
    '썼었':'씀',
    '써':'씀',
    '쓰':'씀',
    '쓰일':'씀',
    '쓰이':'씀',
    '쓴':'씀',
    '쓸':'씀',
    '쓸게요':'씀',
    '씀':'씀',

    '쓰러지':'쓰러짐',

    '쓸데없':'쓸데없음',

    '쓸모있':'쓸모있음',

    '아까운':'아까움',
    '아까울':'아까움',
    '아까워':'아까움',
    '아까워서':'아까움',
    '아깝':'아까움',

    '아니':'아님',
    '아닌':'아님',
    '아닌가':'아님',
    '아닐까':'아님',
    '아님':'아님',
    '아닙니다':'아님',

    '아담':'아담함',

    '아래쪽':'아래',

    '아름답':'아름다움',

    '아부지':'아버지',
    '아빠':'아버지',

    '아쉬운':'아쉬움',
    '아쉬울':'아쉬움',
    '아쉬움':'아쉬움',
    '아쉬워':'아쉬움',
    '아쉬워서':'아쉬움',
    '아쉬웠':'아쉬움',
    '아쉽':'아쉬움',

    '아파':'아픔',
    '아파서':'아픔',
    '아파요':'아픔',
    '아프':'아픔',
    '아픈':'아픔',
    '아플':'아픔',

    '안타깝':'안타까움',

    '알맞':'알맞음',

    '알아듣':'알아들음',

    '알아보':'알아봄',
    '알아본':'알아봄',

    '알아주':'알아줌',

    '알차':'알참',
    '알찬':'알참',

    '앙증':'앙증맞음',
    '앙증맞':'앙증맞음',

    '애기':'아기',

    '애':'아이',

    '앞쪽':'앞',

    '야무지':'야무짐',

    '약하':'약함',
    '약한':'약함',
    '약할':'약함',
    '약합니다':'약함',
    '약해':'약함',
    '약해서':'약함',
    '약해요':'약함',

    '얇':'얇음',

    '어두우':'어두움',
    '어두운':'어두움',
    '어두울':'어두움',
    '어두워':'어두움',
    '어두워서':'어두움',
    '어둡':'어두움',

    '어려우':'어려움',
    '어려울':'어려움',
    '어려움':'어려움',
    '어려운':'어려움',
    '어려워':'어려움',
    '어려워서':'어려움',
    '어려워요':'어려움',
    '어려웠':'어려움',
    '어려웠어요':'어려움',
    '어렵':'어려움',

    '어울려':'어울림',
    '어울려서':'어울림',
    '어울려요':'어울림',
    '어울리':'어울림',
    '어울립니다':'어울림',

    '어이없':'어이없음',

    '엄청나':'엄청남',
    '엄처난':'엄청남',

    '엉켜서':'엉킴',
    '엉키':'엉킴',

    '없':'없음',
    '없음':'없음',
    '없인':'없음',

    '없애':'없앰',
    '없앨':'없앰',
    '없앴':'없앰',

    '역쉬':'역시',

    '열려':'열림',
    '열려서':'열림',
    '열리':'열림',
    '열릴':'열림',

    '열받':'열받음',

    '열일':'열일함',

    '염려':'염려함',

    '예뻐':'예쁨',
    '예뻐서':'예쁨',
    '예뻐요':'예쁨',
    '예뻤':'예쁨',
    '예뿌':'예쁨',
    '예쁘':'예쁨',
    '예쁜':'예쁨',
    '예쁜데':'예쁨',
    '예쁠':'예쁨',
    '예쁩니다':'예쁨',
    '이뻐':'예쁨',
    '이뻐서':'예쁨',
    '이뻐요':'예쁨',
    '이쁘':'예쁨',
    '이쁜':'예쁨',
    '이쁨':'예쁨',

    '오래가':'오래감',

    '올라가':'올림',
    '올리':'올림',
    '올려':'올림',
    '올렸':'올림',
    '올릴':'올림',
    '올립니다':'올림',

    '옮기':'옮김',
    '옮길':'옮김',

    '왔':'옴',
    '왓':'옴',
    '왔어요':'옴',
    '왔었':'옴',
    '왔으니':'옴',
    '왔음':'옴',

    '왓챠':'왓차',

    '움직이':'움직임',

    '원하':'원함',
    '원해서':'원함',
    '원했':'원함',

    '원활':'원활함',

    '월욜':'월요일',

    '유투브':'유튜브',

    '음료수':'음료',

    '얘기':'이야기',

    '이젠':'이제',

    '일욜':'일요일',

    '은은':'은은함',

    '자그마':'자그마함',

    '자잘':'자잘함',

    '작':'작음',
    '작고':'작음',

    '작아져서':'작아짐',
    '작아졌':'작아짐',
    '작아지':'작아짐',
    '작아진':'작아짐',

    '재미':'재밌음',
    '재미있':'재밌음',
    '재밌':'재밌음',

    '쟁여':'쟁여놓음',

    '저렴':'저렴함',

    '적당':'적당함',

    '전자렌지':'전자레인지',

    '젊':'젊음',

    '정신없':'정신없음',

    '제품군':'제품',

    '조그마':'조그마함',
    '조그만':'조그마함',

    '조립도':'조립',

    '조용':'조용함',

    '조아':'좋음',
    '조음':'좋음',
    '좋':'좋음',
    '좋아요':'좋음',
    '좋아하':'좋음',
    '좋아함':'좋음',
    '좋아합니다':'좋음',
    '좋아해':'좋음',
    '좋아해서':'좋음',

    '조잡':'조잡함',

    '주황':'주황색',

    '줄어드':'줄어듦',
    '줄어든':'줄어듦',
    '줄어든':'줄어듦',
    '줄어들':'줄어듦',

    '줄여':'줄임',
    '줄여서':'줄임',
    '줄이':'줄임',

    '중소':'중소기업',

    '즐거운':'즐거움',
    '즐거울':'즐거움',
    '즐거워':'즐거움',
    '즐거워요':'즐거움',
    '즐겁':'즐거움',

    '즐거워졌':'즐거워짐',

    '즐겨':'즐김',
    '즐기':'즐김',
    '즐길':'즐김',

    '지나':'지나감',
    '지나가':'지나감',
    '지나간':'지나감',
    '지난':'지나감',
    '지났':'지나감',

    '지나치':'지나침',

    '지르':'지름',
    '질렀':'지름',

    '지연':'지연됨',

    '지저분':'지저분함',

    '지체':'지체됨',

    '지쳐서':'지침',

    '지켜보':'지켜봄',
    '지켜봐야':'지켜봄',

    '짜증':'짜증남',

    '짧':'짧음',

    '짱짱':'짱',

    '쨍하':'쨍함',

    '찌그러':'찌그러짐',
    '찌그러져':'찌그러짐',
    '찌그러져서':'찌그러짐',
    '찌그러지':'찌그러짐',
    '찌그러진':'찌그러짐',

    '찌든':'찌듦',

    '찍혀':'찍힘',
    '찍혀서':'찍힘',
    '찍히':'찍힘',
    '찍힌':'직힘',

    '찜찜':'찜찜함',

    '찝찝':'찝찝함',

    '찢':'찢어짐',
    '찢어져':'찢어짐',
    '찢어져서':'찢어짐',
    '찢어지':'찢어짐',

    '차가운':'차가움',

    '차분':'차분함',

    '착하':'착함',
    '착한':'착함',
    '착한데':'착함',
    '착합니다':'착함',
    '착해':'착함',
    '착해서':'착함',
    '착해요':'착함',
    '찰해서':'착함',

    '찰지':'찰짐',
    '찰진':'찰짐',

    '채우':'채움',
    '채워':'채움',

    '청소로':'청소',

    '초록':'초록색',

    '촉박':'촉박함',

    '촌스럽':'촌스러움',

    '추천요':'추천',

    '충분':'충분함',

    '충실':'충실함',
    '충실하':'충실함',

    '충족':'충족시킴',

    '취소':'취소함',

    '취약':'취약함',

    '친정댁':'친정',
    '친정집':'친정',

    '친정어머님':'친정어머니',

    '커다란':'커다람',
    '커도':'커다람',

    '커져서':'커짐',
    '커졌':'커짐',
    '커지':'커짐',
    '커진':'커짐',

    '컴':'컴퓨터',

    '켜':'키다',
    '켠':'키다',
    '켰':'키다',
    '켤':'키다',

    '켜져':'켜짐',
    '켜졌':'켜짐',
    '켜진':'켜짐',

    'quality':'퀄리티',
    'Quality':'퀄리티',
    'Quality':'퀄리티',

    '크':'큼',
    '큰':'큼',
    '큰가':'큼',
    '큰데':'큼',
    '큰지':'큼',
    '클까':'큼',
    '클수록':'큼',
    '큼':'큼',
    '큼지막':'큼',
    '큼직':'큼',
    '큽니다':'큼',
    '커':'큼',
    '커서':'큼',
    '커요':'큼',
    '컸':'큼',
    '클':'큼',

    '탁한':'탁함',

    '택배기사님':'택배기사',

    '토욜':'토요일',

    '통도':'통',
    '통이':'통',

    '튀어나오':'튀어나옴',
    '튀어나온':'튀어나옴',
    '튀어나와':'튀어나옴',

    '틀려':'틀림',
    '틀리':'틀림',

    '파란':'파란색',
    '파랑':'파란색',

    '파란불이':'파란불',

    '편하':'편함',
    '편한':'편함',
    '편한데':'편함',
    '편할':'편함',
    '편함':'편함',
    '편합니다':'편함',
    '편해':'편함',
    '편해서':'편함',
    '편해요':'편함',
    '편했':'편함',

    '편해졌':'편해짐',

    '편안':'편안함',

    '페가전':'폐가전',

    '하양':'하얀색',

    '화나':'화남',
    '화났':'화남',
    '화낼':'화남',

    '화이트로':'하얀색',

    '화욜':'화요일',

    '화칠':'화질',

    '환하':'환함',
    '환해':'환함',
    '환해서':'환함',
    '환해졌':'환함',
    '환해진다':'환함',
    '환화':'환함',

    '허옇':'허옇다',

    '허접':'허접함',

    '헐거워':'헐거움',
    '헐겁':'헐거움',

    '헐렁':'헐렁함',

    '헤매':'헤맴',
    '헤맸':'헤맴',
    '헤메':'헤맴',

    '헷갈리':'헷갈림',

    '형편':'형편없음',
    '형편없':'형편없음',

    '화':'화남',

    '화려':'화려함',

    '화이팅':'화이팅하세요',

    '환한':'환함',

    '황당':'황당함',

    '훌륭':'훌륭함',

    '흐려':'흐림',
    '흐리':'흐림',
    '흐린':'흐림',

    '흐릿':'흐릿함',

    '흐뭇':'흐뭇함',
    '흐믓':'흐뭇함',


    '흔들':'흔들림',
    '흔들거리':'흔들림',
    '흔들리':'흔들림',

    '흘러':'흘림',
    '흘리':'흘림',

    '흠잡':'흠잡을데가없음',

    '흡인력':'흡입력',

    '흡족':'흡족함',

    '흥건':'흥건함',

    '힘드':'힘듦',
    '힘든':'힘듦',
    '힘든데':'힘듦',
    '힘들':'힘듦',
    '힘듭니다':'힘듦',

    '힘차':'힘이참'

}
func = lambda x: mapping_list.get(x, x)



def bulyong(x):
    if (x[1] in bulyong_pumsa or x[0] in bulyong_pyo or x in bulyong_) and x not in bujeong_:
        return None
    elif x in bujeong_:
        return x
    else :
        return x[0]

# determine
def part1(k, test,b):
    ne_issue = []
    # get the data
    if k == "d":
        # 배송긍부정사전
        f_pos = open('app/dict/d_po.txt').read()
        f_neg = open('app/dict/d_ne.txt').read()
    elif k == "p":
        # 상품긍부정사전
        f_pos = open('app/dict/p_po.txt').read()
        f_neg = open('app/dict/p_ne.txt').read()

    elif k == "s":
        # 서비스긍부정사전
        f_pos = open('app/dict/s_po.txt').read()
        f_neg = open('app/dict/s_ne.txt').read()

    test_line = test
    test_s = test_line
    test_list = mecab.pos(test_s)
    test_output=[]
    for i in test_list:
        if i[1] == u'SW':
            if i[0] in [u'♡', u'♥']:
                test_output.append(i[0])
        if bulyong(i) != None:
            test_output.append(bulyong(i))
            # test_output.append(i[0])
    test_output = list(map(func,test_output))

    list_positive=[]
    list_negative=[]

    # getting_list함수를 통해 필요한 tag를 추출하여 list 생성
    list_positive = getting_list(f_pos, list_positive)
    list_negative = getting_list(f_neg, list_negative)

    #전체 카운트, 함수에 들어가야한다. (all_count)
    ALL = len(set(list_positive))+len(set(list_negative))

    # naive bayes 값 계산
    result_pos = naive_bayes_classifier(test_output, list_positive, ALL)
    result_neg = naive_bayes_classifier(test_output, list_negative, ALL)

    # determine
    det = ""
    if (result_pos > result_neg):
        if((('안', 'MAG') in test_list) or (('못', 'MAG') in test_list) or (('않', 'VX') in test_list) or (('아니', 'VCN') in test_list)):
            # print(u'1부정')
            det = "부정"
        else:
            # print(u'2긍정')
            det = "긍정"
    elif (result_neg > result_pos):
        if((('안', 'MAG') in test_list) or (('못', 'MAG') in test_list) or (('않', 'VX') in test_list) or (('아니', 'VCN') in test_list)):
            # print(u'3긍정')
            det = "긍정"
        else:
            # print(u'4부정')
            det = "부정"
    else:
        # print(u'5중립')
        det = "판별불가"

    if (det == "부정"):
        for x in range(len(test_output)):
            for y in range(len(list_negative)):
                if (test_output[x]==list_negative[y]):
                    # print(list_negative)
                    ne_issue.append(test_output[x])
    f=open(b,"a")
    for x in ne_issue:
        if (x not in bujeong_):
            f.write(x)
            f.write("\n")
    f.close()
    # return det


# make lists
def getting_list(filename, listname):
    listname = filename.split('\n')
    return listname

# naive bayes classifier + smoothing
def naive_bayes_classifier(test, train, all_count):
    counter = 0
    list_count = []
    for i in test:
        for j in range(len(train)):
            if i == train[j]:
                counter = counter + 1
        list_count.append(counter)
        counter = 0
    list_naive = []
    for i in range(len(list_count)):
        list_naive.append((list_count[i]+1)/float(len(train)+all_count))
    result = 1
    for i in range(len(list_naive)):
        result *= float(round(list_naive[i], 6))
    return float(result)*float(1.0/3.0)

def main(data):
    for x in range(len(data)):
        part1("d", data[x],"app/dict/ne_issue_d.txt")
        part1("p", data[x],"app/dict/ne_issue_p.txt")
        part1("s", data[x],"app/dict/ne_issue_s.txt")
